<?php
# 紫微斗数所有得星星
$_CONF['starAll'] = array();
$_CONF['starAll']['jia_main_star'] = array('紫微','天机','太阳','武曲','天同','廉贞','天府','太阴','贪狼','巨门','天相','天梁','七杀','破军');
$_CONF['starAll']['jia_fu_star'] = array('天魁','天钺','左辅','右弼','文昌','文曲','禄存','天马','擎羊','陀罗','火星','铃星','地空','地劫');
$_CONF['starAll']['yi_fu_star'] = array('天刑','天姚','解神','阴煞','天巫','天月','三台','八座','恩光','天贵','台辅','封诰','天福','天官','天厨','天空','天哭','天虚','龙池','凤阁','红鸾','天喜','孤城','寡宿','蜚廉','破碎','华盖','咸池','天德1','月德','天才','天寿');
$_CONF['starAll']['bing_fu_star'] = array('天伤','天使','截空','旬空','长生','沐浴','冠带','临官','帝旺','衰','病','死','墓','绝','胎','养','博士','力士','青龙','小耗1','将军1','奏书','飞廉','喜神','病符1','大耗1','伏兵','官府');
$_CONF['starAll']['ding_fu_star'] = array('岁建','龙德','天德2','将军2','攀鞍','岁驿');
$_CONF['starAll']['wu_fu_star'] = array('晦气','丧门','贯索','官符','小耗2','大耗2','白虎','吊客','病符2','息神','劫煞','灾煞','天煞','指背','月煞','亡神');

